from django.core.management.base import BaseCommand
from box.apps.sw_shop.sw_catalog.models import * 


from random import choice, randrange, randint 

 
itemsx = [
    {
        "title":"Світлодіодний вуличний світильник Schreder Skido 23 Вт",
        "description":"Skido – це гарантія компактного та економічного світлодіодного рішення для зміни світильників. Це ідельний варіант для освітлення житлових вулиць, автостоянок, пішохідних зон, парків, освітлення для відеоспостереження в промислових приміщеннях та офісах. Skido витримує найсуворіші умови експлуатації: діапазон робочих температур - від -20°C до to 50°C, діапазон робочих напруг - від 198 до 264В, а міцні конструкційні матеріали забезпечують високу ударостійкість світильника.  Дизайн світильника забезпечує високу ступінь захисту від проникнення пилу та вологи, що гарантує стабільні фотометричні характеристики в довгостроковій перспективі.",
        "features":{
            "Кількість LED":"6 LED",
            "Номінальний світловий потік (лм)*":"2100",
            "Оптика":"5122AC",
            "Споживана потужність (Вт)":"23",
            "Залишковий світловий потік 100.000год tq 35°C":"70%",
            "Колірна температура":"4000К або 5000К",
            "CRI":">70",
            "Номінальна напруга ":"198 - 264 В; 50 Гц",
            "Захист від перенапруг":"10 кВ",
            "DALI, 1-10V":"Відсутнє",
            "Оптичний блок":"IP 65 (**)",
            "Драйвер":"IP 65 (**)",
            "Ударостійкість":"IK 07 (***)",
            "Клас електробезпеки ":"I (**)",
            "Вага":"1.3 кг",
            "Корпус":"алюмінієвий",
            "Розсіювач":"полікарбонатний",
            "Колір":"RAL 7037 сірий",
            "Температурний діапазон роботи":"-20 °C ... +50 °C",
            "Монтаж":"4 гвинтами M8 на трубу Ø 32 - 42 мм. ",
            "Рекомендована висота встановлення світильника":"3 - 6 м",
        },
    },
    {
        "title":"Світлодіодний вуличний світильник Schreder Nano LED 36 Вт",
        "description":"Nano LED є надзвичайно компактним, виготовлений з використанням енергоефективних LED технологій, оснащений оптичною системою Lens0Flex®2. Такий варіант світильника підходить для освітлення громадського простору. Nano LED може використовуватися у всіх типах застосувань вуличного освітлення з кріпленням на консоль та висотою установки від 4 до 6 метрів. Корпус та кришка Nano LED відлиті під тиском з алюмінієвого сплаву, розсіювач - з гартованого скла. Силіконовий ущільнювач забезпечує ступінь захисту світильника ІР66. Завдяки концепції FutureProof конструкція світильника дозволяє замінити оптику і блок управління по закінченню терміну служби світлодіодів і дає можливість скористатися майбутніми технологічними досягненнями.",
        "features":{
            "Кількість LED":"16 LED",
            "Номінальний світловий потік*":"4000 Лм",
            "Оптика":"5102AC",
            "Залишковий світловий потік 100.000год tq 25°C**":"80%",
            "Колірна температура":"4000К",
            "CRI":">70",
            "Споживана потужність LED модуля":"36 Вт",
            "Струм LED модуля":"700 мА",
            "Номінальна напруга живлення":"230 В; 50 Гц",
            "Коефіцієнт потужності":">0.95",
            "Захист від перенапруг":"10 кВ",
            "Дімування (DALI або 1-10V)":"Є",
            "Бездротове керування  по протоколу ZigBee":"Можливість постачання із роз'ємом NEMA 7 для встановлення системи керування (як опція, уточнювати при замовленні)",
            "Бездротове керування по протоколу Bluetooth":"Немає",
            "Програмування драйвера світильника":"Без дімування, програмоване дімування, сталий світловий потік (CLO) ",
            "Ступінь захисту":"IP 66 (***)",
            "Ударостійкість (скло)":"IK 08 (****)",
            "Клас електробезпеки ":"I або II (***)",
            "Вага":"3.9 кг",
            "Аеродинамічний опір":"-",
            "Корпус + кришка":"Відлиті під тиском з алюмінієвого сплаву, покриті порошковою поліефірною фарбою",
            "Розсіювач":"Випукле гартоване скло",
            "Колір":"AKZO  900 сірий",
            "Температурний діапазон роботи":"-20 °C ... +50 °C",
            "Монтаж":"Для бокового монтажу на консолі діаметром 48 або 60мм (як опція через перехідник), за допомогою 2 кріпильних гвинтів M8 з нержавіючої сталі",
            "Рекомендована висота встановлення світильника":"4 - 8 м",
        },
    },
]





class Command(BaseCommand):
    def handle(self, *args, **kwargs):
        items = Item.objects.all()[0:2]
        for item in items:
            index = list(items).index(item)
            title = itemsx[index]['title']
            description = itemsx[index]['description']
            item.title = title
            item.description = description
            item.save()
            for name, value in itemsx[index]['features']:
                feature = Feature.objects.get(
                    name__name__uk   = name,
                )
                values = FeatureValue.objects.get(
                    value__value__uk = value,

                )
                ItemFeature.objects.get_or_create(
                    item=item,
                    feature=feature,
                    value=value,
                )








