Repository: starwayagency/eleek
Catalog: box/core/*_watermarker/_watermarker/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Opacity should be more 0 and less 1. This is a rule!
ru: Непрозрачность должна быть должна быть между 0 и 1. Это правило!

source: tile
ru: плиточно

source: scale
ru: масштабировано

source: buttom right corner
ru: нижний правый угол

source: top rigth corner
ru: верхний правый угол

source: buttom left corner
ru: нижний левый угол

source: top left corner
ru: верхний левый угол

source: Title
ru: Заголовок

source: Opacity
ru: Непрозрачность

source: Value must be between 0 and 1
ru: Значение должно быть от 0 до 1

source: Position
ru: Расположение

source: Indent X
ru: Отступ по оси Х

source: Indent Y
ru: Отступ по оси У

source: Is active
ru: Активна

source: Update hard
ru: Агрессивно обновлять ватермарки

source: Use it if you want to update all already created watermarks
ru: Используйте, если хотите обновить уже созданные ватермарки. Бьет по производительности
